# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

* 1) columns, index and values properties
* 2) Usefull methods
    - 1. unique
    - 2. value_counts
    - 3. sort_values
    - 4. statistics
    - 5. aggregate
    - 6. head, tail, info, describe
* 3) Apply function

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'col1':[1,5,3,2,4],'col2':[444,222,666,444,555],'col3':['abc','xyz','ijklmn','xyz', 'defgh']})
df

   col1  col2    col3
0     1   444     abc
1     5   222     xyz
2     3   666  ijklmn
3     2   444     xyz
4     4   555   defgh

## 1) columns, index and values properties

In [3]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [4]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [5]:
df.values

array([[1, 444, 'abc'],
       [5, 222, 'xyz'],
       [3, 666, 'ijklmn'],
       [2, 444, 'xyz'],
       [4, 555, 'defgh']], dtype=object)

##  2) Usefull methods

In [6]:
df

   col1  col2    col3
0     1   444     abc
1     5   222     xyz
2     3   666  ijklmn
3     2   444     xyz
4     4   555   defgh

### 1. unique

In [7]:
df['col2'].unique()

array([444, 222, 666, 555], dtype=int64)

In [8]:
df['col2'].nunique()

4

In [9]:
df['col1'].nunique()

5

### 2. values_count

In [10]:
df

   col1  col2    col3
0     1   444     abc
1     5   222     xyz
2     3   666  ijklmn
3     2   444     xyz
4     4   555   defgh

In [14]:
df['col2'].value_counts()

444    2
222    1
666    1
555    1
Name: col2, dtype: int64

In [12]:
## Try to switch this to dict

In [13]:
{key:value for  key, value  in zip ( list (df['col2'].value_counts().index), list (df['col2'].value_counts())) }

{444: 2, 222: 1, 666: 1, 555: 1}

In [14]:
df['col3'].value_counts()

xyz       2
abc       1
ijklmn    1
defgh     1
Name: col3, dtype: int64

### 3. sort_values

In [15]:
df

   col1  col2    col3
0     1   444     abc
1     5   222     xyz
2     3   666  ijklmn
3     2   444     xyz
4     4   555   defgh

In [16]:
df.sort_values(by='col2') # inplace=False by default

   col1  col2    col3
1     5   222     xyz
0     1   444     abc
3     2   444     xyz
4     4   555   defgh
2     3   666  ijklmn

In [17]:
df

   col1  col2    col3
0     1   444     abc
1     5   222     xyz
2     3   666  ijklmn
3     2   444     xyz
4     4   555   defgh

In [18]:
df.sort_values(by='col2', ascending=False) # inplace=False by default

   col1  col2    col3
2     3   666  ijklmn
4     4   555   defgh
0     1   444     abc
3     2   444     xyz
1     5   222     xyz

In [19]:
df.sort_values(by='col3') # inplace=False by default

   col1  col2    col3
0     1   444     abc
4     4   555   defgh
2     3   666  ijklmn
1     5   222     xyz
3     2   444     xyz

In [20]:
df.sort_values(by='col3', ascending=False) # inplace=False by default

   col1  col2    col3
1     5   222     xyz
3     2   444     xyz
2     3   666  ijklmn
4     4   555   defgh
0     1   444     abc

In [21]:
df

   col1  col2    col3
0     1   444     abc
1     5   222     xyz
2     3   666  ijklmn
3     2   444     xyz
4     4   555   defgh

In [22]:
df.sort_values(by='col2', ascending=False, inplace=True)

In [23]:
df.sort_values(by=['col2','col1' ] , ascending=[False,False] , inplace=True)

In [24]:
df

   col1  col2    col3
2     3   666  ijklmn
4     4   555   defgh
3     2   444     xyz
0     1   444     abc
1     5   222     xyz

### 4. statistics

**mean**

In [25]:
df.mean()

C:\Users\WAEL~1.MOH\AppData\Local\Temp/ipykernel_15356/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

col1      3.0
col2    466.2
dtype: float64

In [26]:
df.mean(axis=1)

C:\Users\WAEL~1.MOH\AppData\Local\Temp/ipykernel_15356/3676274908.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(axis=1)

2    334.5
4    279.5
3    223.0
0    222.5
1    113.5
dtype: float64

In [27]:
df['col2'].mean()

466.2

**median**

In [28]:
df.median()

C:\Users\WAEL~1.MOH\AppData\Local\Temp/ipykernel_15356/530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

col1      3.0
col2    444.0
dtype: float64

**mode**

In [29]:
df.mode()

   col1   col2 col3
0     1  444.0  xyz
1     2    NaN  NaN
2     3    NaN  NaN
3     4    NaN  NaN
4     5    NaN  NaN

**standard deviation**

In [30]:
df[['col1' , 'col2']].std()

col1      1.581139
col2    164.639606
dtype: float64

**quantile**

In [39]:
df.sort_values(by='col1')

   col1  col2    col3
0     1   444     abc
3     2   444     xyz
2     3   666  ijklmn
4     4   555   defgh
1     5   222     xyz

In [43]:
Q1 = df.quantile(0.25)
Q1

col1      2.0
col2    444.0
Name: 0.25, dtype: float64

In [44]:
Q3 = df.quantile(0.75)
Q3

col1      4.0
col2    555.0
Name: 0.75, dtype: float64

In [45]:
iqr = Q3 - Q1
iqr

col1      2.0
col2    111.0
dtype: float64

**correlation**

In [46]:
df.corr()

          col1      col2
col1  1.000000 -0.319801
col2 -0.319801  1.000000

### 5. aggregate

**max**

In [47]:
df.max()

col1      5
col2    666
col3    xyz
dtype: object

In [48]:
df

   col1  col2    col3
2     3   666  ijklmn
4     4   555   defgh
3     2   444     xyz
0     1   444     abc
1     5   222     xyz

In [54]:
df[['col1' , 'col2']].max(axis=1)

2    666
4    555
3    444
0    444
1    222
dtype: int64

**min**

In [55]:
df.min()

col1      1
col2    222
col3    abc
dtype: object

In [56]:
df.min(axis=1)

C:\Users\WAEL~1.MOH\AppData\Local\Temp/ipykernel_15356/2573389239.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.min(axis=1)

2    3
4    4
3    2
0    1
1    5
dtype: int64

**sum**

In [57]:
df.sum()

col1                      15
col2                    2331
col3    ijklmndefghxyzabcxyz
dtype: object

In [58]:
df.sum(axis=1)

C:\Users\WAEL~1.MOH\AppData\Local\Temp/ipykernel_15356/1459321664.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum(axis=1)

2    669
4    559
3    446
0    445
1    227
dtype: int64

In [59]:
df['col1'].sum()

15

**count**

In [60]:
df.count()

col1    5
col2    5
col3    5
dtype: int64

In [61]:
df.count(axis=1)

2    3
4    3
3    3
0    3
1    3
dtype: int64

### 6. head, tail, info, describe

In [62]:
df = pd.DataFrame({'col1':[1,2,3,np.nan, 4, 5, 6],
                   'col2':[np.nan,555,666,444, 4, 5, 6],
                   'col3':['abc','def','ghi','xyz', 4, 5, 6],
                   'col4':['abc','def','ghi','xyz', 4, 5, 6],
                   'col5':['abc','def','ghi','xyz', 4, 5, 6]})
df

   col1   col2 col3 col4 col5
0   1.0    NaN  abc  abc  abc
1   2.0  555.0  def  def  def
2   3.0  666.0  ghi  ghi  ghi
3   NaN  444.0  xyz  xyz  xyz
4   4.0    4.0    4    4    4
5   5.0    5.0    5    5    5
6   6.0    6.0    6    6    6

In [63]:
df.head()

   col1   col2 col3 col4 col5
0   1.0    NaN  abc  abc  abc
1   2.0  555.0  def  def  def
2   3.0  666.0  ghi  ghi  ghi
3   NaN  444.0  xyz  xyz  xyz
4   4.0    4.0    4    4    4

In [64]:
df.head(2)

   col1   col2 col3 col4 col5
0   1.0    NaN  abc  abc  abc
1   2.0  555.0  def  def  def

In [65]:
df.tail()

   col1   col2 col3 col4 col5
2   3.0  666.0  ghi  ghi  ghi
3   NaN  444.0  xyz  xyz  xyz
4   4.0    4.0    4    4    4
5   5.0    5.0    5    5    5
6   6.0    6.0    6    6    6

In [66]:
df.tail(2)

   col1  col2 col3 col4 col5
5   5.0   5.0    5    5    5
6   6.0   6.0    6    6    6

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    6 non-null      float64
 1   col2    6 non-null      float64
 2   col3    7 non-null      object
 3   col4    7 non-null      object
 4   col5    7 non-null      object
dtypes: float64(2), object(3)
memory usage: 408.0+ bytes

In [72]:
df

   col1   col2 col3 col4 col5
0   1.0    NaN  abc  abc  abc
1   2.0  555.0  def  def  def
2   3.0  666.0  ghi  ghi  ghi
3   NaN  444.0  xyz  xyz  xyz
4   4.0    4.0    4    4    4
5   5.0    5.0    5    5    5
6   6.0    6.0    6    6    6

In [73]:
df.describe()

           col1        col2
count  6.000000    6.000000
mean   3.500000  280.000000
std    1.870829  309.319899
min    1.000000    4.000000
25%    2.250000    5.250000
50%    3.500000  225.000000
75%    4.750000  527.250000
max    6.000000  666.000000

## 3) Apply Functions

**1. apply a function to return a new column**

In [74]:
df = pd.DataFrame({'col1':[1,5,3,2,4],'col2':[444,222,666,444,555],'col3':['abc','xyz','ijklmn','xyz', 'defgh']})
df

   col1  col2    col3
0     1   444     abc
1     5   222     xyz
2     3   666  ijklmn
3     2   444     xyz
4     4   555   defgh

In [75]:
df['radius'] = df['col1'] + 20
df

   col1  col2    col3  radius
0     1   444     abc      21
1     5   222     xyz      25
2     3   666  ijklmn      23
3     2   444     xyz      22
4     4   555   defgh      24

In [76]:
def area_of_circle(r):
    return 3.14 * (r ** 2)

In [77]:
df['radius'].apply(area_of_circle)

0    1384.74
1    1962.50
2    1661.06
3    1519.76
4    1808.64
Name: radius, dtype: float64

In [78]:
df['area'] = df['radius'].apply(area_of_circle)
df

   col1  col2    col3  radius     area
0     1   444     abc      21  1384.74
1     5   222     xyz      25  1962.50
2     3   666  ijklmn      23  1661.06
3     2   444     xyz      22  1519.76
4     4   555   defgh      24  1808.64

In [79]:
df['area_lambda'] = df['radius'].apply(lambda r: 3.14 * (r ** 2))
df

   col1  col2    col3  radius     area  area_lambda
0     1   444     abc      21  1384.74      1384.74
1     5   222     xyz      25  1962.50      1962.50
2     3   666  ijklmn      23  1661.06      1661.06
3     2   444     xyz      22  1519.76      1519.76
4     4   555   defgh      24  1808.64      1808.64

In [80]:
 df['col2'].apply(lambda x: x ** 2)

0    197136
1     49284
2    443556
3    197136
4    308025
Name: col2, dtype: int64

In [81]:
df

   col1  col2    col3  radius     area  area_lambda
0     1   444     abc      21  1384.74      1384.74
1     5   222     xyz      25  1962.50      1962.50
2     3   666  ijklmn      23  1661.06      1661.06
3     2   444     xyz      22  1519.76      1519.76
4     4   555   defgh      24  1808.64      1808.64

In [82]:
df['col3'].apply(lambda x: x * 2)

0          abcabc
1          xyzxyz
2    ijklmnijklmn
3          xyzxyz
4      defghdefgh
Name: col3, dtype: object

In [83]:
df['col3'].apply(len)

0    3
1    3
2    6
3    3
4    5
Name: col3, dtype: int64

**2. apply a function to return multi columns**

In [84]:
df

   col1  col2    col3  radius     area  area_lambda
0     1   444     abc      21  1384.74      1384.74
1     5   222     xyz      25  1962.50      1962.50
2     3   666  ijklmn      23  1661.06      1661.06
3     2   444     xyz      22  1519.76      1519.76
4     4   555   defgh      24  1808.64      1808.64

In [85]:
def make_multi_columns(value):
    return pd.Series((value + 50, value - 100))

In [86]:
df[['Col_New_1', 'Col_New_2']] = df['radius'].apply(make_multi_columns)

In [87]:
df

   col1  col2    col3  radius     area  area_lambda  Col_New_1  Col_New_2
0     1   444     abc      21  1384.74      1384.74         71        -79
1     5   222     xyz      25  1962.50      1962.50         75        -75
2     3   666  ijklmn      23  1661.06      1661.06         73        -77
3     2   444     xyz      22  1519.76      1519.76         72        -78
4     4   555   defgh      24  1808.64      1808.64         74        -76

**3. apply a function on many columns and return multi columns**

In [88]:
def apply_multi_columns_make_multi_columns(x):
    return pd.Series((x['area'] / x['radius'], x['radius'] + x['area']))

In [90]:
df[['Col_New_3', 'Col_New_4']] = df.apply(apply_multi_columns_make_multi_columns, axis=1)

In [91]:
df

,col1,col2,col3,radius,area,area_lambda,Col_New_1,Col_New_2,Col_New_3,Col_New_4
0,1,444,abc,21,1384.74,1384.74,71,-79,65.94,1405.74
1,5,222,xyz,25,1962.50,1962.50,75,-75,78.50,1987.50
2,3,666,ijklmn,23,1661.06,1661.06,73,-77,72.22,1684.06
3,2,444,xyz,22,1519.76,1519.76,72,-78,69.08,1541.76
4,4,555,defgh,24,1808.64,1808.64,74,-76,75.36,1832.64

# Great Job!